Revit 2027 API
ParameterTypeId.DividedSurfaceComponentTrimType Property
 "Component Trim"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfaceComponentTrimType { get; }
Public Shared ReadOnly Property DividedSurfaceComponentTrimType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfaceComponentTrimType {
	ForgeTypeId^ get ();
}
static member DividedSurfaceComponentTrimType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace